<template>
  <div :class="aboutClasses" :style="{padding: '0 2vw'}">
    <h1>Добро пожаловать в мир Nustly: Вашего надежного партнера в мире продуктов!</h1>
    <p>Nustly - это компания, которая ставит перед собой задачу обеспечить своих клиентов высококачественными продуктами, удовлетворяя самые разнообразные потребности. Наше предприятие специализируется на продаже разнообразных товаров, предлагая широкий ассортимент продукции высокого стандарта.</p>
    <h2>Наши ценности:</h2>
    <ol>
      <li><strong>Качество продукции:</strong> Мы тщательно выбираем каждый продукт, предлагаемый нашим клиентам, чтобы гарантировать выдающееся качество и безопасность использования.</li>
      <li><strong>Широкий ассортимент:</strong> В нашем ассортименте вы найдете все, что нужно для комфортной и насыщенной жизни. От продуктов питания до товаров бытовой техники - мы позаботились о разнообразии, чтобы удовлетворить любой вкус и запрос.</li>
      <li><strong>Отличное обслуживание клиентов:</strong> Команда Nustly гордится предоставлением выдающегося обслуживания клиентов. Мы стремимся к полному удовлетворению потребностей наших заказчиков, предоставляя оперативную поддержку и индивидуальный подход.</li>
    </ol>
    <h2>Наши продукты:</h2>
    <ul>
      <li><strong>Продукты питания:</strong> От свежих овощей и фруктов до деликатесов и готовых блюд - мы предлагаем только лучшие продукты для вашего стола.</li>
      <li><strong>Товары для дома:</strong> У нас есть все необходимое для создания уюта в вашем доме, начиная от бытовой химии и заканчивая предметами интерьера.</li>
      <li><strong>Электроника и техника:</strong> Мы следим за последними технологическими тенденциями и предлагаем современные устройства для удовлетворения вашей потребности в высококачественной технике.</li>
    </ul>
    <p>Выбрав Nustly, вы выбираете надежность, качество и внимание к вашим потребностям. Доверьтесь нам, и мы сделаем все возможное для того, чтобы ваш опыт покупок был приятным и удовлетворительным!</p>
  </div>
</template>

<script setup lang="ts">
import { useThemeStore } from '@/shered/store/theme';
import { storeToRefs } from 'pinia';
import { computed } from 'vue';

//theme store
const themeStore = useThemeStore();
const { isDarkTheme } = storeToRefs(themeStore);

const aboutClasses = computed(() => {
  return { 'about-container': true, ['about-container_dark']: isDarkTheme.value };
});
</script>

<style src="./AboutPage.style.scss" lang="scss" scoped></style>