<template>
  <div class="container-agreement" :style="{padding: '0 2vw'}">
    <h1>Условия использования</h1>
    <ol>
      <li><strong>Прием и условия использования сайта:</strong> Пользуясь данным веб-сайтом, вы автоматически соглашаетесь с условиями использования. Если вы не согласны с этими условиями, пожалуйста, не используйте сайт.</li>
      <li><strong>Интеллектуальная собственность:</strong> Весь контент на сайте, включая текст, графику, логотипы, изображения, аудио и видео материалы, защищены авторским правом и принадлежат владельцам сайта. Не разрешается копирование, распространение или использование контента без явного письменного разрешения.</li>
      <li><strong>Отказ от ответственности:</strong> Использование сайта осуществляется на ваш собственный риск. Владельцы сайта не несут ответственности за возможные убытки или ущерб, причиненные использованием сайта.</li>
      <li><strong>Изменения и дополнения:</strong> Владельцы сайта оставляют за собой право вносить изменения в условия использования в любое время без предварительного уведомления. Пожалуйста, регулярно проверяйте условия использования на предмет обновлений.</li>
    </ol>
    <h1>Уведомление о конфиденциальности</h1>
    <ol>
      <li><strong>Сбор информации:</strong> Мы собираем определенную информацию о пользователях, включая персональные данные, такие как имя, адрес электронной почты и другие сведения, предоставленные пользователями добровольно.</li>
      <li><strong>Использование информации:</strong> Собранные данные используются для обеспечения функциональности сайта, предоставления информации, а также для улучшения пользовательского опыта. Мы стремимся обеспечить конфиденциальность и безопасность вашей информации.</li>
      <li><strong>Разглашение информации:</strong> Мы не продаем, не обмениваем и не передаем личные данные третьим лицам без вашего разрешения, за исключением случаев, предусмотренных законом.</li>
      <li><strong>Безопасность:</strong> Мы предпринимаем разумные меры безопасности для защиты личной информации пользователей от утери, злоупотребления или несанкционированного доступа.</li>
      <li><strong>Ссылки на сторонние сайты:</strong> Наши условия использования и уведомление о конфиденциальности применяются только к нашему веб-сайту. Мы не несем ответственности за политику конфиденциальности на сторонних сайтах, на которые могут ссылаться наши страницы.</li>
      <li><strong>Изменения в политике конфиденциальности:</strong> Мы оставляем за собой право вносить изменения в наше уведомление о конфиденциальности. Изменения вступают в силу с момента их публикации на сайте.</li>
    </ol>
    <p>Пожалуйста, ознакомьтесь с этими документами перед использованием сайта. В случае вопросов, свяжитесь с нами по указанным на сайте контактам.</p>
    <router-link to="/reg" 
     > <button-elem
      :clName="null"
      :title="'Вернуться'"
      :handler="() => null"
      :width="'20vw'"
      :height="'48px'"
      :background="'#70C05B'"
      :textColor="null"
      :fontSize="null"
      :fontWeight="null"
      :margin="'24px 0 0 0'"
      :borderRadius="'10px'"
      :icon="null"
    /></router-link>
  </div>
</template>

<script setup lang="ts">

</script>

<style scoped>
  h1 {
    font-size: 30px;
    margin-bottom: 20px;
  }
  h2 {
    font-size: 25px;
    margin-bottom: 20px;
  }
  p {
    margin-bottom: 20px;
  }
  li {
    margin-bottom: 10px;
  }
</style>